; domain
(define (domain dragonball_z_budokai_tenkaichi)
  (:requirements :strips :typing)
  (:types
    player vs_duel character stage location
  )

  (:predicates
    (vs_duel_selected ?duel - vs_duel)
    (player_selected ?player - player)
    (character_selected ?player - player ?character - character)
    (stage_specified ?stage - stage)
    (present ?character - character)
    (located ?player - player ?loc - location)
    (against_wall ?player - player)
    (separated ?player1 - player ?player2 - player)
  )

  ;;    VS Duel
  (:action select_vs_duel
    :parameters (?duel - vs_duel)
    :precondition (not (vs_duel_selected ?duel))
    :effect (vs_duel_selected ?duel)
  )

  ;;
  (:action select_player
    :parameters (?player - player)
    :precondition (not (player_selected ?player))
    :effect (player_selected ?player)
  )

  ;;
  (:action select_character
    :parameters (?player - player ?character - character)
    :precondition (and (present ?character) (not (character_selected ?player ?character)))
    :effect (character_selected ?player ?character)
  )

  ;;
  (:action specify_stage
    :parameters (?stage - stage)
    :precondition (not (stage_specified ?stage))
    :effect (stage_specified ?stage)
  )

  ;;
  (:action move_to_wall
    :parameters (?player1 - player ?player2 - player ?loc1 - location ?loc2 - location)
    :precondition (and
                    (located ?player1 ?loc1)
                    (located ?player2 ?loc2)
                    (vs_duel_selected duel1)
                    (character_selected ?player1 goku)
                    (character_selected ?player2 goku))
    :effect (and
              (located ?player1 against_wall)
              (located ?player2 against_wall)
              (against_wall ?player1)
              (against_wall ?player2)
              (separated ?player1 ?player2)
            )
  )
)

; problem
(define (problem dragonball_z_budokai_tenkaichi_problem)
  (:domain dragonball_z_budokai_tenkaichi)

  (:objects
    player1 player2 - player
    goku - character
    stage1 - stage
    duel1 - vs_duel
    away_from_wall against_wall on_middle_of_street on_end_of_street - location
  )

  (:init
    (not (vs_duel_selected duel1))
    (not (player_selected player1))
    (not (player_selected player2))
    (present goku)
    (not (character_selected player1 goku))
    (not (character_selected player2 goku))
    (not (stage_specified stage1))
    (located player1 away_from_wall)
    (located player2 away_from_wall)
    (not (against_wall player1))
    (not (against_wall player2))
    (not (separated player1 player2))
  )

  (:goal
    (and
      (vs_duel_selected duel1)
      (player_selected player1)
      (player_selected player2)
      (character_selected player1 goku)
      (character_selected player2 goku)
      (stage_specified stage1)
      (located player1 against_wall)
      (located player2 against_wall)
      (against_wall player1)
      (against_wall player2)
      (separated player1 player2)
    )
  )
)

; plan
1. (select_vs_duel duel1)
   added: (vs_duel_selected duel1)
   goals met: 1 of 11
2. (select_character player2 goku)
   added: (character_selected player2 goku)
   goals met: 2 of 11
3. (select_character player1 goku)
   added: (character_selected player1 goku)
   goals met: 3 of 11
4. (move_to_wall player1 player2 away_from_wall away_from_wall)
   added: (located player1 against_wall) (located player2 against_wall) (against_wall player1) (against_wall player2) (separated player1 player2)
   goals met: 8 of 11
5. (specify_stage stage1)
   added: (stage_specified stage1)
   goals met: 9 of 11
6. (select_player player2)
   added: (player_selected player2)
   goals met: 10 of 11
7. (select_player player1)
   added: (player_selected player1)
   goals met: 11 of 11
